# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 + ACmix + OBB (P3–P5)

# =======================
# Parameters
# =======================
nc: 1
reg_max: 16
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# =======================
# Backbone
# =======================
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0 P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1 P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2

  - [-1, 1, Conv, [256, 3, 2]] # 3 P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4

  - [-1, 1, Conv, [512, 3, 2]] # 5 P4/16
  - [-1, 2, C3k2, [512, True]] # 6

  - [-1, 1, Conv, [1024, 3, 2]] # 7 P5/32
  - [-1, 2, C3k2, [1024, True]] # 8

  - [-1, 1, SPPF, [1024, 5]] # 9

  # ---- ACmix block ----
  - [-1, 2, C2PSA_ACmix, [1024]] # 10: ACmix directly (maintains scaled channels)

# =======================
# Head (FPN + PAN)
# =======================
head:
  # P5 → P4
  - [-1, 1, Conv, [256, 1, 1]] # 11
  - [-1, 1, nn.Upsample, [None, 2, nearest]] # 12

  - [6, 1, Conv, [256, 1, 1]] # 13: P4 proj (from layer 6)
  - [[-2, -1], 1, Concat, [1]] # 14
  - [-1, 2, C3k2, [256, False]] # 15

  # P4 → P3
  - [-1, 1, nn.Upsample, [None, 2, nearest]] # 16
  - [4, 1, Conv, [256, 1, 1]] # 17: P3 proj (from layer 4)
  - [[-2, -1], 1, Concat, [1]] # 18
  - [-1, 2, C3k2, [256, False]] # 19: P3 output

  # PAN down (P3 → P4)
  - [-1, 1, Conv, [256, 3, 2]] # 20
  - [[-1, 15], 1, Concat, [1]] # 21: concat with layer 15
  - [-1, 2, C3k2, [256, False]] # 22: P4 output

  # PAN down (P4 → P5)
  - [-1, 1, SCDown, [256, 3, 2]] # 23
  - [[-1, 11], 1, Concat, [1]] # 24: concat with layer 11
  - [-1, 2, C3k2, [256, True]] # 25: P5 output

  # =======================
  # OBB Head
  # =======================
  - [[19, 22, 25], 1, OBB, [nc, 1]] # 26: OBB detection head
